import React from 'react';
import { useTranslation } from 'react-i18next';
import './homepage.scss';
import { useSelector } from 'react-redux';
import { AuthSelectors } from '../../../store/slice/auth';
import Card from '../../layouts/card/card';
import TestList from '../../test-list/test-list';

const HomePage = () => {

  const user = useSelector(AuthSelectors.selectUser);
  const { t } = useTranslation();


  
  return (
    <>
    {
      user ?
      <TestList title={t('all-tests')}/>
      :
    <Card>
        <img src="image.png" alt="ONTU-logo" className="ontu-logo"/>
        <h1>Відділ організації дистанційної роботи та навчання центру ІКТ</h1>
        <p>Дистанційне навчання (ДН) - це технологія, що базується на принципах відкритого навчання, яка широко використовує комп’ютерні учбові програми різного призначення і створює за допомогою сучасних телекомунікацій інформаційне освітнє середовище для навчального матеріалу і спілкування.</p>
        <p>Для цієї технології характерна сильна пізнавальна мотивація, яка створюється мережею Інтернет, а також якістю підготовки спеціаліста. Все це робить дистанційне навчання - технологією навчання 21 століття.</p>
        <p>Дистанційне навчання стає все більш і більш популярним як у всьому світі, так і в Україні. Дистанційна освіта буває різною по типу: це і вебінари, і онлайн-семінари, і навчання через Zoom чи MS Teams, і дистанційна вища освіта з одержанням диплома, який нічим не відрізняється від одержаного при стаціонарному навчанні.</p>
        <p>В ОНТУ активно розвивається проект по ДН. Створений відділ організації дистанційної роботи та навчання центру ІКТ, затверджені Положення про дистанційне навчання в ОНТУ та Положення про відділ організації дистанційної роботи та навчання центру ІКТ, на сайті відділу організації дистанційної роботи та навчання центру ІКТ розміщені створені в системі Moodle навчальні курси для дистанційного та самостійного вивчення по дисциплінам, що викладаються в університеті. В навчальних курсах студентам доступні силабуси; конспекти лекцій; матеріали для лабораторних, практичних робіт; контрольні завдання; тести (після проходження яких можна побачити одержані оцінки).</p>
        <p>Для роботи з навчальними курсами необхідно пройти реєстрацію, про особливості якої можна дізнатись на вкладці «Реєстрація користувачів».</p>
    </Card>
    }
    </>
  );
}

export default HomePage;